# Exercise 1: Movie Reviews

## rating.sql
```SQL
/* Delete the tables if they already exist */
drop table if exists Movie;
drop table if exists Reviewer;
drop table if exists Rating;

/* Create the schema for our tables */
create table Movie(mID int, title text, year int, director text);
create table Reviewer(rID int, name text);
create table Rating(rID int, mID int, stars int, ratingDate date);

/* Populate the tables with our data */
insert into Movie values(101, 'Gone with the Wind', 1939, 'Victor Fleming');
insert into Movie values(102, 'Star Wars', 1977, 'George Lucas');
insert into Movie values(103, 'The Sound of Music', 1965, 'Robert Wise');
insert into Movie values(104, 'E.T.', 1982, 'Steven Spielberg');
insert into Movie values(105, 'Titanic', 1997, 'James Cameron');
insert into Movie values(106, 'Snow White', 1937, null);
insert into Movie values(107, 'Avatar', 2009, 'James Cameron');
insert into Movie values(108, 'Raiders of the Lost Ark', 1981, 'Steven Spielberg');

insert into Reviewer values(201, 'Sarah Martinez');
insert into Reviewer values(202, 'Daniel Lewis');
insert into Reviewer values(203, 'Brittany Harris');
insert into Reviewer values(204, 'Mike Anderson');
insert into Reviewer values(205, 'Chris Jackson');
insert into Reviewer values(206, 'Elizabeth Thomas');
insert into Reviewer values(207, 'James Cameron');
insert into Reviewer values(208, 'Ashley White');

insert into Rating values(201, 101, 2, '2011-01-22');
insert into Rating values(201, 101, 4, '2011-01-27');
insert into Rating values(202, 106, 4, null);
insert into Rating values(203, 103, 2, '2011-01-20');
insert into Rating values(203, 108, 4, '2011-01-12');
insert into Rating values(203, 108, 2, '2011-01-30');
insert into Rating values(204, 101, 3, '2011-01-09');
insert into Rating values(205, 103, 3, '2011-01-27');
insert into Rating values(205, 104, 2, '2011-01-22');
insert into Rating values(205, 108, 4, null);
insert into Rating values(206, 107, 3, '2011-01-15');
insert into Rating values(206, 106, 5, '2011-01-19');
insert into Rating values(207, 107, 5, '2011-01-20');
insert into Rating values(208, 104, 3, '2011-01-02');
```

### Query Exercises:

#### Q1: Find the titles of all movies directed by Steven Spielberg. 

```SQL
select title
from Movie
where director = 'Steven Spielberg';
```

#### Q2: Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order. 

```SQL
select distinct Movie.year
from Movie join Rating using(mID)
where Rating.stars = 4 or Rating.stars = 5
order by Movie.year;
```

#### Q3: Find the titles of all movies that have no ratings. 

```SQL
select title
from movie
where mID not in (select mID from rating where stars not null);
```

#### Q4: Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value for the date. 

```SQL
select reviewer.name
from reviewer join rating using(rID)
where ratingDate is null;
```

#### Q5: Write a query to return the ratings data in a more readable format: reviewer name, movie title, stars, and ratingDate. Also, sort the data, first by reviewer name, then by movie title, and lastly by number of stars. 

```SQL
select reviewer.name, movie.title, rating.stars, rating.ratingDate
from movie join rating using(mID) join reviewer using(rID)
order by reviewer.name, movie.title, rating.stars;
```

#### Q6: For all cases where the same reviewer rated the same movie twice and gave it a higher rating the second time, return the reviewer's name and the title of the movie. 

```SQL
--1st Solution:
select reviewer.name, movie.title
from movie join (select R1.mID, R1.rID from rating R1, rating R2 
                 where R1.mID = R2.mID and R1.rID = R2.rID 
                 and R1.ratingDate < R2.ratingDate 
                 and R1.stars < R2.stars) using(mID) join reviewer using(rID);
                 
--2nd Solution:
select R1.name, R1.title
from (reviewer join rating using(rID) join movie using(mID)) as R1, rating R2
where R1.rID in (select rID
				 from rating
				 group by rID
				 having count(rID) = 2)
and R1.rID = R2.rID
and R1.mID = R2.mID
and R1.ratingDate < R2.ratingDate
and R1.stars < R2.stars;
```

#### Q7: For each movie that has at least one rating, find the highest number of stars that movie received. Return the movie title and number of stars. Sort by movie title. 

```SQL
select title, stars
from movie join rating using(mID)
group by movie.mID
having rating.stars = max(rating.stars)
order by title
```

#### Q8:For each movie, return the title and the 'rating spread', that is, the difference between highest and lowest ratings given to that movie. Sort by rating spread from highest to lowest, then by movie title. 

```SQL
select title, (maxR - minR) as ratingSpread
from (select title, max(stars) as maxR, min(stars) as minR
      from movie join rating using(mID)
      group by mID)
order by ratingSpread desc, title;
```

#### Q9: Find the difference between the average rating of movies released before 1980 and the average rating of movies released after 1980. (Make sure to calculate the average rating for each movie, then the average of those averages for movies before 1980 and movies after. Don't just calculate the overall average rating before and after 1980.) 

```SQL
select avg(pre1980avg) - avg(post1980avg) as ratingDiff
from (select mID, avg(stars) as pre1980avg
	  from rating join movie using(mID)
	  group by mID
	  having year < 1980),
	 (select mID, avg(stars) as post1980avg
	  from rating join movie using(mID)
	  group by mID
	  having year > 1980);
```

### Modification Exercises:

#### Q1: Add the reviewer Roger Ebert to your database, with an rID of 209. 
    
```SQL
insert into reviewer values (209, 'Roger Ebert');
```

#### Q2: Insert 5-star ratings by James Cameron for all movies in the database. Leave the review date as NULL. 

```SQL
-- "Correct" answer:
insert into rating
select (select distinct rID from reviewer where name = 'James Cameron'), mID, 5, null
from movie;

-- What I think it should be to avoid duplicate ratings by James Cameron:
insert into rating
select (select distinct rID from reviewer where name = 'James Cameron'), mID, 5, null
from movie 
where mID not in (select distinct mID 
                  from rating 
                  where rID = (select distinct rID from reviewer where name = 'James Cameron'));
```

#### Q3: For all movies that have an average rating of 4 stars or higher, add 25 to the release year. (Update the existing tuples; don't insert new tuples.) 

```SQL
update movie
set year = year + 25
where mID in (select distinct mID 
              from rating 
              group by mID 
              having avg(stars) >= 4);
```

#### Q4: Remove all ratings where the movie's year is before 1970 or after 2000, and the rating is fewer than 4 stars. 

```SQL
delete from rating
where mID in (select distinct mID from movie where year < 1970 or year > 2000) and stars < 4;
```

# Exercise 2: Highschool Drama

## social.sql:

```SQL
/* Delete the tables if they already exist */
drop table if exists Highschooler;
drop table if exists Friend;
drop table if exists Likes;

/* Create the schema for our tables */
create table Highschooler(ID int, name text, grade int);
create table Friend(ID1 int, ID2 int);
create table Likes(ID1 int, ID2 int);

/* Populate the tables with our data */
insert into Highschooler values (1510, 'Jordan', 9);
insert into Highschooler values (1689, 'Gabriel', 9);
insert into Highschooler values (1381, 'Tiffany', 9);
insert into Highschooler values (1709, 'Cassandra', 9);
insert into Highschooler values (1101, 'Haley', 10);
insert into Highschooler values (1782, 'Andrew', 10);
insert into Highschooler values (1468, 'Kris', 10);
insert into Highschooler values (1641, 'Brittany', 10);
insert into Highschooler values (1247, 'Alexis', 11);
insert into Highschooler values (1316, 'Austin', 11);
insert into Highschooler values (1911, 'Gabriel', 11);
insert into Highschooler values (1501, 'Jessica', 11);
insert into Highschooler values (1304, 'Jordan', 12);
insert into Highschooler values (1025, 'John', 12);
insert into Highschooler values (1934, 'Kyle', 12);
insert into Highschooler values (1661, 'Logan', 12);

insert into Friend values (1510, 1381);
insert into Friend values (1510, 1689);
insert into Friend values (1689, 1709);
insert into Friend values (1381, 1247);
insert into Friend values (1709, 1247);
insert into Friend values (1689, 1782);
insert into Friend values (1782, 1468);
insert into Friend values (1782, 1316);
insert into Friend values (1782, 1304);
insert into Friend values (1468, 1101);
insert into Friend values (1468, 1641);
insert into Friend values (1101, 1641);
insert into Friend values (1247, 1911);
insert into Friend values (1247, 1501);
insert into Friend values (1911, 1501);
insert into Friend values (1501, 1934);
insert into Friend values (1316, 1934);
insert into Friend values (1934, 1304);
insert into Friend values (1304, 1661);
insert into Friend values (1661, 1025);
insert into Friend select ID2, ID1 from Friend;

insert into Likes values(1689, 1709);
insert into Likes values(1709, 1689);
insert into Likes values(1782, 1709);
insert into Likes values(1911, 1247);
insert into Likes values(1247, 1468);
insert into Likes values(1641, 1468);
insert into Likes values(1316, 1304);
insert into Likes values(1501, 1934);
insert into Likes values(1934, 1501);
insert into Likes values(1025, 1101);
```

### Query Exercises:

#### Q1: Find the names of all students who are friends with someone named Gabriel.

```SQL
select distinct highschooler.name
from friend, highschooler
where friend.ID1 = highschooler.ID and friend.ID2 in (select ID from highschooler where name = 'Gabriel');
```

#### Q2: For every student who likes someone 2 or more grades younger than themselves, return that student's name and grade, and the name and grade of the student they like. 

```SQL
select H1.name, H1.grade, H2.name, H2.grade
from highschooler H1, highschooler H2, likes L
where H1.ID = L.ID1 and H2.ID = L.ID2 and (H1.grade - H2.grade) >= 2;
```

#### Q3: For every pair of students who both like each other, return the name and grade of both students. Include each pair only once, with the two names in alphabetical order. 

```SQL
select distinct 	H1.name, H1.grade, H2.name, H2.grade
from highschooler H1, highschooler H2, likes L1, likes L2
where H1.ID = L1.ID1 and H2.ID = L1.ID2
and H1.ID = L2.ID2 and H2.ID = L2.ID1
and H1.name < H2.name;
```

#### Q4: Find all students who do not appear in the Likes table (as a student who likes or is liked) and return their names and grades. Sort by grade, then by name within each grade. 

```SQL
select name, grade
from highschooler
where highschooler.ID not in (select ID1 from likes union select ID2 from likes)
order by grade, name;
```

#### Q5: For every situation where student A likes student B, but we have no information about whom B likes (that is, B does not appear as an ID1 in the Likes table), return A and B's names and grades. 

```SQL
select A.name, A.grade, B.name, B.grade
from highschooler A, highschooler B, likes L
where A.ID = L.ID1 and B.ID = L.ID2
and B.ID not in (select ID1 from likes);
```

#### Q6: Find names and grades of students who only have friends in the same grade. Return the result sorted by grade, then by name within each grade. 

```SQL
select name, grade
from highschooler H
where H.ID not in (select distinct H1.ID
                   from highschooler H1, highschooler H2, friend F
                   where H1.ID = F.ID1 and H2.ID = F.ID2 and H1.grade <> H2.grade)
order by grade, name;
```

#### Q7: For each student A who likes a student B where the two are not friends, find if they have a friend C in common (who can introduce them!). For all such trios, return the name and grade of A, B, and C. 
    
```SQL
select A.name, A.grade, B.name, B.grade, C.name, C.grade
from highschooler A, highschooler B, highschooler C, friend F1, friend F2, likes L
where A.ID = L.ID1 and B.ID = L.ID2
and B.ID not in (select ID2 from friend where ID1 = A.ID)
and C.ID = F1.ID1 and A.ID = F1.ID2
and C.ID = F2.ID1 and B.ID = F2.ID2;
```

#### Q8: Find the difference between the number of students in the school and the number of different first names. 

```SQL
select (numStudents - numNames)
from (select count(*) as numStudents
	  from highschooler),
	 (select count(distinct name) as numNames
	 from highschooler);
```

#### Q9: Find the name and grade of all students who are liked by more than one other student. 

```SQL
select name, grade
from (select *, count(*) as numLikers
	from likes, highschooler
	where ID = ID2
	group by ID2)
where numLikers > 1;
```

### Modification Exercises:

#### Q1: It's time for the seniors to graduate. Remove all 12th graders from Highschooler. 

```SQL
delete from highschooler
where grade = 12;
```

#### Q2: If two students A and B are friends, and A likes B but not vice-versa, remove the Likes tuple. 

```SQL
delete from likes
where ID1 in (select F.ID1 from friend F where F.ID2 = likes.ID2)
and ID2 in (select L.ID2 from likes L where L.ID1 = likes.ID1)
and ID1 not in (select L.ID2 from likes L where L.ID1 = likes.ID2);
```

#### Q3: For all cases where A is friends with B, and B is friends with C, add a new friendship for the pair A and C. Do not add duplicate friendships, friendships that already exist, or friendships with oneself. (This one is a bit challenging; congratulations if you get it right.) 
 
```SQL
insert into friend
select distinct A.ID, C.ID
from highschooler A, highschooler B, highschooler C, friend F1, friend F2
where A.ID = F1.ID1 and B.ID = F1.ID2
and B.ID = F2.ID1 and C.ID = F2.ID2
and not exists (select * from friend where friend.ID1 = A.ID and friend.ID2 = C.ID)
and A.ID <> C.ID;
```